{
    "Dashboard": "لوحة التحكم",
    "Search": "بحث",
    "Repository": "المستودع",
    "Documentation": "التوثيق",
    "Settings": "الإعدادات",
    "Log Out": "تسجيل الخروج",
    "Platform": "المنصة",
    "Profile": "الملف الشخصي",
    "Password": "كلمة المرور",
    "Two-Factor Auth": "المصادقة الثنائية",
    "Appearance": "المظهر",
    "Light": "فاتح",
    "Dark": "داكن",
    "System": "النظام",
    "Delete account": "حذف الحساب",
    "Delete your account and all of its resources": "حذف حسابك وجميع موارده",
    "Are you sure you want to delete your account?": "هل أنت متأكد أنك تريد حذف حسابك؟",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.": "بمجرد حذف حسابك، سيتم حذف جميع موارده وبياناته بشكل دائم. يرجى إدخال كلمة المرور لتأكيد رغبتك في حذف حسابك بشكل دائم.",
    "Cancel": "إلغاء",
    "Name": "الاسم",
    "Email": "البريد الإلكتروني",
    "Your email address is unverified.": "عنوان بريدك الإلكتروني غير مُتحقق منه.",
    "Click here to re-send the verification email.": "انقر هنا لإعادة إرسال بريد التحقق.",
    "A new verification link has been sent to your email address.": "تم إرسال رابط تحقق جديد إلى عنوان بريدك الإلكتروني.",
    "Save": "حفظ",
    "Saved.": "تم الحفظ.",
    "Update password": "تحديث كلمة المرور",
    "Ensure your account is using a long, random password to stay secure": "تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية للبقاء آمناً",
    "Current password": "كلمة المرور الحالية",
    "New password": "كلمة المرور الجديدة",
    "Confirm Password": "تأكيد كلمة المرور",
    "Two-Factor Authentication Enabled": "تم تفعيل المصادقة الثنائية",
    "Two-factor authentication is now enabled. Scan the QR code or enter the setup key in your authenticator app.": "تم تفعيل المصادقة الثنائية الآن. امسح رمز QR أو أدخل مفتاح الإعداد في تطبيق المصادقة الخاص بك.",
    "Close": "إغلاق",
    "Verify Authentication Code": "التحقق من رمز المصادقة",
    "Enter the 6-digit code from your authenticator app.": "أدخل الرمز المكون من 6 أرقام من تطبيق المصادقة الخاص بك.",
    "Continue": "متابعة",
    "Enable Two-Factor Authentication": "تفعيل المصادقة الثنائية",
    "To finish enabling two-factor authentication, scan the QR code or enter the setup key in your authenticator app.": "لإنهاء تفعيل المصادقة الثنائية، امسح رمز QR أو أدخل مفتاح الإعداد في تطبيق المصادقة الخاص بك.",
    "Two Factor Authentication": "المصادقة الثنائية",
    "Manage your two-factor authentication settings": "إدارة إعدادات المصادقة الثنائية الخاصة بك",
    "Enabled": "مفعل",
    "With two-factor authentication enabled, you will be prompted for a secure, random pin during login, which you can retrieve from the TOTP-supported application on your phone.": "مع تفعيل المصادقة الثنائية، سيُطلب منك إدخال رمز PIN آمن وعشوائي أثناء تسجيل الدخول، والذي يمكنك استرجاعه من التطبيق المدعوم بـ TOTP على هاتفك.",
    "Disable 2FA": "تعطيل المصادقة الثنائية",
    "Disabled": "معطل",
    "When you enable two-factor authentication, you will be prompted for a secure pin during login. This pin can be retrieved from a TOTP-supported application on your phone.": "عند تفعيل المصادقة الثنائية، سيُطلب منك إدخال رمز PIN آمن أثناء تسجيل الدخول. يمكن استرجاع هذا الرمز من تطبيق مدعوم بـ TOTP على هاتفك.",
    "Enable 2FA": "تفعيل المصادقة الثنائية",
    "Back": "رجوع",
    "Confirm": "تأكيد",
    "or, enter the code manually": "أو، أدخل الرمز يدوياً",
    "2FA Recovery Codes": "رموز استرداد المصادقة الثنائية",
    "Recovery codes let you regain access if you lose your 2FA device. Store them in a secure password manager.": "تتيح لك رموز الاسترداد استعادة الوصول إذا فقدت جهاز المصادقة الثنائية الخاص بك. احفظها في مدير كلمات مرور آمن.",
    "View Recovery Codes": "عرض رموز الاسترداد",
    "Hide Recovery Codes": "إخفاء رموز الاسترداد",
    "Regenerate Codes": "إعادة إنشاء الرموز",
    "Each recovery code can be used once to access your account and will be removed after use. If you need more, click Regenerate Codes above.": "يمكن استخدام كل رمز استرداد مرة واحدة للوصول إلى حسابك وسيتم إزالته بعد الاستخدام. إذا كنت بحاجة إلى المزيد، انقر فوق إعادة إنشاء الرموز أعلاه.",
    "Confirm password": "تأكيد كلمة المرور",
    "This is a secure area of the application. Please confirm your password before continuing.": "هذه منطقة آمنة من التطبيق. يرجى تأكيد كلمة المرور قبل المتابعة.",
    "Forgot password": "نسيت كلمة المرور",
    "Enter your email to receive a password reset link": "أدخل بريدك الإلكتروني لتلقي رابط إعادة تعيين كلمة المرور",
    "Email Address": "عنوان البريد الإلكتروني",
    "Email password reset link": "إرسال رابط إعادة تعيين كلمة المرور",
    "Or, return to": "أو، العودة إلى",
    "log in": "تسجيل الدخول",
    "Log in to your account": "تسجيل الدخول إلى حسابك",
    "Enter your email and password below to log in": "أدخل بريدك الإلكتروني وكلمة المرور أدناه لتسجيل الدخول",
    "Email address": "عنوان البريد الإلكتروني",
    "Password": "كلمة المرور",
    "Forgot your password?": "نسيت كلمة المرور؟",
    "Remember me": "تذكرني",
    "Log in": "تسجيل الدخول",
    "Don't have an account?": "ليس لديك حساب؟",
    "Sign up": "إنشاء حساب",
    "Create an account": "إنشاء حساب",
    "Enter your details below to create your account": "أدخل بياناتك أدناه لإنشاء حسابك",
    "Full name": "الاسم الكامل",
    "Confirm password": "تأكيد كلمة المرور",
    "Create account": "إنشاء حساب",
    "Already have an account?": "هل لديك حساب بالفعل؟",
    "Log in": "تسجيل الدخول",
    "Manage your profile and account settings": "إدارة ملفك الشخصي وإعدادات حسابك",
    "Update your name and email address": "تحديث اسمك وعنوان بريدك الإلكتروني",
    "Update the appearance settings for your account": "تحديث إعدادات المظهر لحسابك",
    "Reset password": "إعادة تعيين كلمة المرور",
    "Please enter your new password below": "يرجى إدخال كلمة المرور الجديدة أدناه",
    "Please verify your email address by clicking on the link we just emailed to you.": "يرجى التحقق من عنوان بريدك الإلكتروني بالنقر على الرابط الذي أرسلناه إليك للتو.",
    "A new verification link has been sent to the email address you provided during registration.": "تم إرسال رابط تحقق جديد إلى عنوان البريد الإلكتروني الذي قدمته أثناء التسجيل.",
    "Resend verification email": "إعادة إرسال بريد التحقق",
    "Log out": "تسجيل الخروج"
}

